# matrixH  = [[2 , 3 , 4] , [5 , 6 , 7]]
# matrixV = [[2 , 5] , [3 , 6], [4 , 7]]
# matriec = [[[2 , 3 , 4] , [5 , 6 , 7]],[[2 , 5] , [3 , 6], [4 , 7]] ]
# names = ['Elbek' , 'Iskandar', 'Umar']
# print(names[0])

# индекцация с право на лево начинается с -1
# индекцация с лево на право начинается с 1
names = ['Elbek' , 'Sardor' , 'Umar' , 'Abduvali', 'Xasan']
# print(names[2:4:1]) # тоесть возбми от 2го индекса до 4 индекса но 4 индекс не входит и ходи по одному шагу
# print(names[2::2]) #тут нету конца значит он возмёт от двух до Хасана и он входит по два шага
# print(names[::2]) # тут нету конца и начала значит ходи от старта до конца по два шага
# print(names[::-1]) тут он переварачивает просто и всё
# print(names[:]) тут просто он копирует список и всё без квадратных скобок
# names.sort сортировка
# names.reverse он тоже просто перевернёт список

